&НаКлиенте
Процедура КнопкаОтправитьЗапросНажатие(Элемент, СтандартнаяОбработка)
    АдресВебСервиса = Элементы.ПолеАдресВебСервиса.ТекстРедактирования;

    Если НЕ ЗначениеЗаполнено(АдресВебСервиса) Тогда
        Сообщить("Введите адрес веб-сервиса.");
        Возврат;
    КонецЕсли;

    // Отправка запроса и обработка ответа
    Ответ = ОтправитьЗапрос(АдресВебСервиса);
    СообщениеОтвета = Ответ.Получить("transformedReceipts");
    
    // Обработка JSON на сервере
    РезультатЗагрузки = ОбработатьJSONНаСервере(СообщениеОтвета);
    Сообщить(СтрШаблон("Загружено: %1. Пропущено: %2", РезультатЗагрузки.СчетчикЗагружено, РезультатЗагрузки.СчетчикПропущено));
КонецПроцедуры

Функция ОтправитьЗапрос(АдресВебСервиса) Экспорт
    Попытка
        ПараметрыЗапроса = Новый Структура;
        ПараметрыЗапроса.Вставить("dateFrom", Формат(ДатаС, "ДФ=yyyy-MM-dd"));
        ПараметрыЗапроса.Вставить("dateTo", Формат(ДатаДо, "ДФ=yyyy-MM-dd"));
            
        ОтветПост = КоннекторHTTP.Post(АдресВебСервиса, ПараметрыЗапроса);
        Ответ = КоннекторHTTP.КакJson(ОтветПост);
        Возврат Ответ;                                
    Исключение
        Возврат "Ошибка: " + ОписаниеОшибки();
    КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Установка значений по умолчанию
    ДатаДо = ТекущаяДата();
    ДатаС = ТекущаяДата() - 7 * 24 * 60 * 60;
КонецПроцедуры


&НаСервере
Функция ОбработатьJSONНаСервере(СообщениеОтвета) Экспорт
    Попытка
        // Создание временного файла
        ИмяВременногоФайла = ПолучитьИмяВременногоФайла("json");
        ФайлДляЗаписи = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);
        ФайлДляЗаписи.Записать(СообщениеОтвета);
        ФайлДляЗаписи.Закрыть();

        // Загрузка чеков
        НастройкиЗагрузки = Обработки.ЗагрузкаВыпискиБанка.МОД_ПолучитьНастройкиЗагрузкиЧеков();
        РезультатЗагрузки = Обработки.ЗагрузкаВыпискиБанка.МОД_ЗагрузитьЧеки(НастройкиЗагрузки, Новый ДвоичныеДанные(ИмяВременногоФайла), "json");

        Возврат РезультатЗагрузки;
    Исключение
        Возврат Новый Структура("Ошибка", ОписаниеОшибки());
    КонецПопытки;
КонецФункции
